/*
=====================================================================================================================================================================
Bài 4: Đề bài:
Cho 2 số x, y. Nhiệm vụ của bạn là tính x ^ y
=====================================================================================================================================================================
- Gợi ý:
+) x^y sẽ không có phần lẻ thập phân vì x, y đều nguyên.
+) Hàm pow trả về double nên bạn không được in ra luôn cout << pow(x, y).
+) Với kết quả nhỏ thì không sao nhưng nếu kết quả lớn nó sẽ in ra dạng số thực,
bạn thử cout << pow(10, 10) để xem thử kết quả.
+) Cách làm đó là ép pow sang long long trước khi in hoặc lưu pow(x, y) vào 1
số nguyên long long rồi in ra.
=====================================================================================================================================================================
- Input Format:
1 dòng chứa 2 số nguyên dương x, y viết cách nhau một dấu cách
=====================================================================================================================================================================
- Constraints:
1 <= x, y <= 12;
=====================================================================================================================================================================
- Output Format:
In ra x^y, nếu x^y có phần thập phân thì in ra 2 số sau dấu phẩy, nếu không có
phần thập phân thì không cần in.
=====================================================================================================================================================================
- Sample Input 0:
2 2
=====================================================================================================================================================================
- Sample Output 0:
4
=====================================================================================================================================================================
- Sample Input 1:
4 1
=====================================================================================================================================================================
- Sample Output 1:
4
=====================================================================================================================================================================
*/
#include <iostream>
#include <cmath>

using namespace std;

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    
    int x, y;
    cin >> x >> y;

    /* Hàm pow trả về giá trị double: nếu số quá lớn như x = 12, y = 9 nêm hàm pow trả về số
    thực số khoa học => kết quả sai */
    // Chúng ta nên lưu vào biến số nguyên thuộc kiểu dữ liệu long long
    long long luythua = pow(x, y);
    cout << luythua << endl;
    
    return 0;
}

/*
#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    cout.tie(NULL);

    int x, y;
    cin >> x >> y;

    cout << (long long)pow(x, y);

    return 0;
}

*/